# WEEK TWO _ TASK

### Q.1: Writer pandas series code to get following output without using dictionary:

Dictionary: Dictionaries are used to store data values in key:value pairs.

A dictionary is a collection which is ordered*, changeable and do not allow duplicates.

In [4]:
import pandas as pd

In [5]:
this_dict={'a':1,'x':4,'c':9,2:6,'e':7}
print(this_dict)

{'a': 1, 'x': 4, 'c': 9, 2: 6, 'e': 7}

Now as we have to print the dictinoray key and values in column as required in question:

In [6]:
print("Key\tValue")
for key, value in this_dict.items():
    print(f"{key}\t{value}")

Key	Value
a	1
x	4
c	9
2	6
e	7

Explaination of using FOR LOOP : This line prints the headers for the columns, indicating that the first column represents keys and the second column represents values. "\t" is a tab character, which creates a space between "Key" and "Value" for better alignment.

This loop iterates through each key-value pair in the dictionary this_dict using the items() method. For each pair, it prints the key and the corresponding value separated by a tab character. This results in printing each key-value pair in separate rows with the key and value aligned under their respective columns.

### Q.2: Writer pandas series code to get following output using dictionary:
        Bilal   42
        Ayesha  38
        Hadia   39

We will follow the same procedure as we have done in above question

In [7]:
Name_dict={'Bilal':42,"Ayesha":38,"Hadia":39}
print(Name_dict)

{'Bilal': 42, 'Ayesha': 38, 'Hadia': 39}

In [8]:
print("Key\tValue")
for key, value in Name_dict.items():
    print(f"{key}\t{value}")

Key	Value
Bilal	42
Ayesha	38
Hadia	39

### Q.3: Write pandas dataframe code to get following output using python dictionary

In [9]:
dataframe={ 
    'Day':[1/1/2017,1/2/2017,1/3/2017,1/4/2017,1/5/2017,1/6/2017],
    'Temperature':[32,35,28,24,32,31],
    'Windspeed':[6,7,2,7,4,2],
    'Event':["Rain","Sunny","Snow",'Snow','Rain',"Sunny"]

}

In [10]:
df=pd.DataFrame(dataframe)
print(df)

        Day  Temperature  Windspeed  Event
0  0.000496           32          6   Rain
1  0.000248           35          7  Sunny
2  0.000165           28          2   Snow
3  0.000124           24          7   Snow
4  0.000099           32          4   Rain
5  0.000083           31          2  Sunny

### Q.4: In extension to above question, you are required to replace index by ['a','b','c','d','e','f']

In [11]:
df.index = ['a', 'b', 'c', 'd', 'e', 'f']

In [12]:
print(df)

        Day  Temperature  Windspeed  Event
a  0.000496           32          6   Rain
b  0.000248           35          7  Sunny
c  0.000165           28          2   Snow
d  0.000124           24          7   Snow
e  0.000099           32          4   Rain
f  0.000083           31          2  Sunny

### Q.5: In extension to above Q.3, calculate mean, miximum and minimum for label “temperature”

In [13]:
df["Temperature"].mean()

30.333333333333332

In [14]:
df["Temperature"].max()

35

In [15]:
df["Temperature"].min()

24

### Q.6: Import CSV ‘people.csv’ in the given folder. Keep in mind the following instructions:
You’re required to import only specific columns ["First Name", "Sex", "Email", “Phone”, “Job Title”]<br>
Set the following columns ["Sex", "Job Title"] as index columns<br>
Skip following rows [1,5]<br>
Export the CSV as “NewPeople.csv”<br>

Importing file

In [16]:
file_path="./D:\AICP_Internship\Internship_project"

<>:1: SyntaxWarning: invalid escape sequence '\A'
<>:1: SyntaxWarning: invalid escape sequence '\A'
C:\Users\USER\AppData\Local\Temp\ipykernel_3088\2635795156.py:1: SyntaxWarning: invalid escape sequence '\A'
  file_path="./D:\AICP_Internship\Internship_project"

In [25]:
columns_to_import = ["First Name", "Sex", "Email", "Phone", "Job Title"]

In [26]:
df=pd.read_csv('people.csv',usecols=columns_to_import)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  100 non-null    object
 1   Sex         100 non-null    object
 2   Email       100 non-null    object
 3   Phone       100 non-null    object
 4   Job Title   100 non-null    object
dtypes: object(5)
memory usage: 4.0+ KB

As we can see, We have only import the specific columns that are  needed for this task.

Set the following columns ["Sex", "Job Title"] as index columns

In [28]:
# This set the index as Sex and Job Title
df.set_index(["Sex", "Job Title"], inplace=True)
print(df)

                             First Name                       Email  \
Sex    Job Title
Male   Games developer           Shelby        elijah57@example.net
Female Phytotherapist           Phillip       bethany14@example.com
Male   Homeopath               Kristine       bthompson@example.com
       Market researcher        Yesenia   kaitlinkaiser@example.com
       Veterinary surgeon          Lori  buchananmanuel@example.net
...                                 ...                         ...
Female Software engineer         Dennis         bmartin@example.org
       Barrister                  Steve       latasha46@example.net
Male   Police officer            Wesley        regina11@example.org
Female Broadcast journalist      Summer  alexiscantrell@example.org
Male   IT sales professional     Mariah       pcopeland@example.org

                                               Phone
Sex    Job Title
Male   Games developer        001-084-906-7849x73518
Female Phytotherapist              214.112.6044x4913
Male   Homeopath                        277.609.7938
       Market researcher                584.094.6111
       Veterinary surgeon          689-207-3558x7233
...                                              ...
Female Software engineer        001-095-524-2112x257
       Barrister                    001-865-478-5157
Male   Police officer             995-542-3004x76800
Female Broadcast journalist     001-273-685-6932x092
Male   IT sales professional     (341)594-6554x44657

[100 rows x 3 columns]

In [29]:
df.head()

                          First Name                       Email  \
Sex    Job Title
Male   Games developer        Shelby        elijah57@example.net
Female Phytotherapist        Phillip       bethany14@example.com
Male   Homeopath            Kristine       bthompson@example.com
       Market researcher     Yesenia   kaitlinkaiser@example.com
       Veterinary surgeon       Lori  buchananmanuel@example.net

                                            Phone
Sex    Job Title
Male   Games developer     001-084-906-7849x73518
Female Phytotherapist           214.112.6044x4913
Male   Homeopath                     277.609.7938
       Market researcher             584.094.6111
       Veterinary surgeon       689-207-3558x7233

Skip following rows[1,5]

In [30]:
rows_to_skip = [1, 5]

In [33]:
df = pd.read_csv('people.csv', usecols=columns_to_import, skiprows=rows_to_skip)

In [34]:
df.head()

,First Name,Sex,Email,Phone,Job Title
0,Phillip,Female,bethany14@example.com,214.112.6044x4913,Phytotherapist
1,Kristine,Male,bthompson@example.com,277.609.7938,Homeopath
2,Yesenia,Male,kaitlinkaiser@example.com,584.094.6111,Market researcher
3,Erin,Male,tconner@example.org,001-171-649-9856x5553,Waste management officer
4,Katherine,Female,conniecowan@example.com,+1-773-151-6685x49162,Intelligence analyst

Export the CSV as “NewPeople.csv”

In [36]:
df.to_csv("NewPeople.csv")
print("DataFrame has been exported to NewPeople.csv")

DataFrame has been exported to NewPeople.csv

### Q.7: Import excel sheet ‘SampleWork.xlsx’ in the given folder. Keep in mind the following instructions:
Import sheet 1<br>
Import only first and last column from sheet 1<br>
Skip row 2 while importing the sheet<br>
Set row 2 as header<br>
export as new sheet.<br>

* Import sheet 1

In [41]:
df=pd.read_excel("SampleWork.xlsx",sheet_name=0)

In [42]:
df.head()

     Name  Age   Stream  Percentage
0    Amir   18     Math          95
1   Bilal   19  Science          90
2  Sufyan   20  Comerce          85
3   Saiqa   18     Math          80
4   Aimen   32  Science          75

* Import only first and last column from sheet 1

In [49]:
columns_to_import = [0, 3]
#selecting the columns we want to import

In [50]:
df=pd.read_excel("SampleWork.xlsx",sheet_name=0,usecols=columns_to_import)

In [51]:
print(df)

     Name  Percentage
0    Amir          95
1   Bilal          90
2  Sufyan          85
3   Saiqa          80
4   Aimen          75

* Skip row 2 while importing the sheet

In [58]:
rows_to_skip = [1]
#select the row we want to skip

In [59]:
df=pd.read_excel("SampleWork.xlsx",sheet_name=0,usecols=columns_to_import,skiprows=rows_to_skip)

In [60]:
print(df)

     Name  Percentage
0   Bilal          90
1  Sufyan          85
2   Saiqa          80
3   Aimen          75

* Set row 2 as header

In [62]:
df=pd.read_excel("SampleWork.xlsx",sheet_name=0,usecols=columns_to_import,header=1)
print(df)

     Amir  95
0   Bilal  90
1  Sufyan  85
2   Saiqa  80
3   Aimen  75

* export as new sheet.

In [80]:
writer = pd.ExcelWriter("SampleWork.xlsx", engine='openpyxl', mode='a')

In [83]:
df.to_excel(writer, sheet_name='New_SHeet', index=False)

In [84]:
writer.close()

### Q.8: Create the following dataframe as AICP_DF then implement different operations as described below:
select 'Name', 'Qualification' coloumns and save to df1
add a new column to AICP_DF “Height” with the following values: [5.1, 6.2, 5.1, 5.2,5.1]
set column “Name” as the index column.
retrieve row with index “Hifza”
retrieve row with index 3
drop row with index “Bilal

In [85]:
aicp_df={
    'Name':['Sonia',"Bilal","Haifza",'Kabir','Jazim'],
    'Age':[27,24,22,32,23],
    'Addres':['Lahore','Karachi','Sialkot','Peshawar','lhr'],
    'Qualification':['Msc','MA','MCA','Phd','bsc']
}

In [87]:
AICP_DF=pd.DataFrame(aicp_df)
print(AICP_DF)

     Name  Age    Addres Qualification
0   Sonia   27    Lahore           Msc
1   Bilal   24   Karachi            MA
2  Haifza   22   Sialkot           MCA
3   Kabir   32  Peshawar           Phd
4   Jazim   23       lhr           bsc

* select 'Name', 'Qualification' coloumns and save to df1

In [96]:
df1=AICP_DF[['Name','Qualification']]

In [97]:
print(df1)

     Name Qualification
0   Sonia           Msc
1   Bilal            MA
2  Haifza           MCA
3   Kabir           Phd
4   Jazim           bsc

* add a new column to AICP_DF “Height” with the following values: [5.1, 6.2, 5.1, 5.2,5.1]

In [98]:
height_values=[5.1,6.2,5.1,5.2,5.1]
AICP_DF["Hegiht"]=height_values
print(AICP_DF)

     Name  Age    Addres Qualification  Hegiht
0   Sonia   27    Lahore           Msc     5.1
1   Bilal   24   Karachi            MA     6.2
2  Haifza   22   Sialkot           MCA     5.1
3   Kabir   32  Peshawar           Phd     5.2
4   Jazim   23       lhr           bsc     5.1

* set column “Name” as the index column

In [99]:
AICP_DF.set_index('Name', inplace=True)
print(AICP_DF)

        Age    Addres Qualification  Hegiht
Name
Sonia    27    Lahore           Msc     5.1
Bilal    24   Karachi            MA     6.2
Haifza   22   Sialkot           MCA     5.1
Kabir    32  Peshawar           Phd     5.2
Jazim    23       lhr           bsc     5.1

* retrieve row with index “Hifza”

In [102]:
row_haifza = AICP_DF.loc["Haifza"]
print(row_haifza)

Age                   22
Addres           Sialkot
Qualification        MCA
Hegiht               5.1
Name: Haifza, dtype: object

* retrieve row with index 3

In [106]:
row_index = AICP_DF.loc['Kabir']
print(row_index)

Age                    32
Addres           Peshawar
Qualification         Phd
Hegiht                5.2
Name: Kabir, dtype: object

* drop row with index “Bilal

In [107]:
AICP_DF.drop(index="Bilal", inplace=True)
print(AICP_DF)

        Age    Addres Qualification  Hegiht
Name
Sonia    27    Lahore           Msc     5.1
Haifza   22   Sialkot           MCA     5.1
Kabir    32  Peshawar           Phd     5.2
Jazim    23       lhr           bsc     5.1